# 데이터 확인

In [21]:
import pandas as pd
df = pd.read_excel('presidents4.xlsx', index_col='번호')
print(df,type(df))

     이름    키  출생연도 출신지  집권기간              약칭
번호
0   이승만  172  1870  황해   9.0             Lee
1   윤보선  169  1890  충남   0.5            Yoon
2   박정희  162  1910  경북  18.0  President Part
3   최규하  182  1920  강원   0.5            Choi
4   전두환  172  1930  경남   7.0            Jeon
5   노태우  180  1930  경북   5.0             Noe
6   김영삼  172  1920  경남   5.0             Sam
7   김대중  170  1920  전남   5.0             Kim
8   이회창  168  1930  황해   0.0           Chang
9   노무현  165  1940  경남   5.0             Noe
10  이명박  175  1940  경북   5.0             Lee
11  박근혜  163  1950  경북   4.5            Park
12  문재인  173  1950  경남   5.0            Moon
13  윤석열  178  1960  서울   5.0            Seok
14  이재명  175  1960  경북   0.0             Lee <class 'pandas.core.frame.DataFrame'>

## df 확인
계산 가능한 데이터에 대하여 통계값 정리

In [22]:
df.describe()

                키        출생연도       집권기간
count   15.000000    15.00000  15.000000
mean   171.733333  1928.00000   4.966667
std      5.836666    24.84236   4.470006
min    162.000000  1870.00000   0.000000
25%    168.500000  1920.00000   2.500000
50%    172.000000  1930.00000   5.000000
75%    175.000000  1945.00000   5.000000
max    182.000000  1960.00000  18.000000

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 15 entries, 0 to 14
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      15 non-null     object
 1   키       15 non-null     int64
 2   출생연도    15 non-null     int64
 3   출신지     15 non-null     object
 4   집권기간    15 non-null     float64
 5   약칭      15 non-null     object
dtypes: float64(1), int64(2), object(3)
memory usage: 840.0+ bytes

In [24]:
df.head(4)

     이름    키  출생연도 출신지  집권기간              약칭
번호
0   이승만  172  1870  황해   9.0             Lee
1   윤보선  169  1890  충남   0.5            Yoon
2   박정희  162  1910  경북  18.0  President Part
3   최규하  182  1920  강원   0.5            Choi

In [25]:
df.tail(3)

     이름    키  출생연도 출신지  집권기간    약칭
번호
12  문재인  173  1950  경남   5.0  Moon
13  윤석열  178  1960  서울   5.0  Seok
14  이재명  175  1960  경북   0.0   Lee

In [26]:
print(df.values, type(df.values))

[['이승만' 172 1870 '황해' 9.0 'Lee']
 ['윤보선' 169 1890 '충남' 0.5 'Yoon']
 ['박정희' 162 1910 '경북' 18.0 'President Part']
 ['최규하' 182 1920 '강원' 0.5 'Choi']
 ['전두환' 172 1930 '경남' 7.0 'Jeon']
 ['노태우' 180 1930 '경북' 5.0 'Noe']
 ['김영삼' 172 1920 '경남' 5.0 'Sam']
 ['김대중' 170 1920 '전남' 5.0 'Kim']
 ['이회창' 168 1930 '황해' 0.0 'Chang']
 ['노무현' 165 1940 '경남' 5.0 'Noe']
 ['이명박' 175 1940 '경북' 5.0 'Lee']
 ['박근혜' 163 1950 '경북' 4.5 'Park']
 ['문재인' 173 1950 '경남' 5.0 'Moon']
 ['윤석열' 178 1960 '서울' 5.0 'Seok']
 ['이재명' 175 1960 '경북' 0.0 'Lee']] <class 'numpy.ndarray'>

In [27]:
df.index

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14], dtype='int64', name='번호')

In [28]:
df.columns

Index(['이름', '키', '출생연도', '출신지', '집권기간', '약칭'], dtype='object')

In [29]:
df.shape
# 행, 열 수

(15, 6)

## 시리즈 확인

In [30]:
df['키'].describe()

count     15.000000
mean     171.733333
std        5.836666
min      162.000000
25%      168.500000
50%      172.000000
75%      175.000000
max      182.000000
Name: 키, dtype: float64

In [31]:
df['키'].max()

182

In [32]:
df['키'].nlargest(2)

번호
3    182
5    180
Name: 키, dtype: int64

In [33]:
df['키'].mean()

171.73333333333332

In [34]:
df['키'].sum()

2576

In [35]:
df['출신지'].count()

15

In [36]:
df['출신지'].unique()

array(['황해', '충남', '경북', '강원', '경남', '전남', '서울'], dtype=object)

In [37]:
df['출신지'].value_counts()

경북    5
경남    4
황해    2
충남    1
강원    1
전남    1
서울    1
Name: 출신지, dtype: int64